/// Polymorphism (Поліморфізм)
/// Необхідно обробляти різні варіанти поведінки на підставі типу,
/// допускаючи заміну частин системи.
///
/// Пропонується розподілити обов'язки між класами з використанням
/// поліморфних операцій, залишивши кожній зовнішній системі свій інтерфейс.
/// Як приклад можна навести стандартизовані бібліотеки, або конфігурацію
/// застосунку шляхом підключення тих чи інших плагінів для різних замовників
/// під їхні потреби.

/// Наявність у коді конструкції switch є порушенням цього принципу,
/// switch'и підлягають рефакторингу.

/// Зловживання поліморфізмом призводить до переускладнення коду і в загальному
/// випадку не вітається.